Repository: kigombola/Dinari
Catalog: Wallet/lib/l10n/app_*.arb
Languages: sw

source: Welcome back!
sw: Karibu tena!!

source: Enter pin
sw: Ingiza nywila

source: Remember me
sw: Nikumbuke

source: Login
sw: Ingia

source: Does not have an account?
sw: Hauna akaunti??

# registerAccount
source: Register an Account
sw: Fungua akaunti

source: recover password
sw: rudisha nywila

source: Connected to
sw: Inaunganishwa na

source: Send
sw: Tuma

source: Receive
sw: Pokea

# recentTransa
source: Recent transactions
sw: transactions za hivi karibuni

# noTransa
source: No transactions
sw: Hakuna transactions

source: Home
sw: Nyumbani

source: Add Account
sw: Ongeza Akaunti

# trustPartner
source: Trust Partnership
sw: Ushirikiano Aminifu

# selectNet
source: Select Network
sw: Chagua Mtandao

# changeLang
source: Change Language
sw: Badili Lugha

source: Log out
sw: Toka

source: secure
sw: Linda

source: view
sw: Angalia

source: address copied
sw: address imenakiliwa

# contacts
source: Notebook Address
sw: Kitabu cha Address

source: Save
sw: Hifadhi

source: Import new Account
sw: Ingiza account mpya

# pastePrivate
source: Paste Private Key here..
sw: Hamisha Private Key hapa..

# enterAccName
source: Enter account name
sw: Ingiza jina la akaunti

source: Your address
sw: Address yako

source: Paste address
sw: Weka address hapa..

source: Enter address
sw: Ingiza address

# enterAccountPrivateKey
source: Enter private key here
sw: Ingiza private key

# pasteAccountPrivateKey
source: Paste private key here
sw: Weka private key hapa..

source: Create new Account
sw: Tengeneza akaunti mpya

source: Add new Account
sw: Ongeza akaunti mpya

# createanaccountTitle
source: Create an Account
sw: Tengeneza akaunti

source: YES
sw: NDIO

source: NO
sw: HAPANA

source: Account successfully created
sw: Akaunti imefanikiwa kutengenezwa

source: Please Enter private key
sw: Tafadhali weka private key

source: Problem with entered values
sw: Kuna tatizo kwenye data zilizoingizwa

source: Account imported successfully
sw: Akaunti imefanikiwa kuingiza

source: add network
sw: Ongeza network

# networkTitle
source: Networks
sw: Mitandao

source: active
sw: hai

source: network name
sw: jina la mtandao

source: enter network
sw: ingiza jina la mtandao

source: enter ip address
sw: ingiza ip address

# portno
source: port number
sw: namba ya port

source: enter port number
sw: ingiza namba ya poti

source: enter chain id
sw: ingiza chain id

source: cancel
sw: toa

source: submit
sw: wasilisha

source: network added
sw: mtandao umeongezwa

source: Enter PIN to view
sw: Ingiza NYWILA kuona

source: go
sw: nenda

source: please enter pin
sw: tafadhali ingiza nywila

# copy
source: Copy to clipboard
sw: nukuu kwenye ubao wa kunakili

source: share
sw: shirikisha

source: Choose format
sw: Changua muundo

source: Secure your credentials
sw: Fungia utambulisho wako

# storecredential
source: Store your address and private key to your email for future account recovery
sw: Hifadhi address yako na private key kwa barua pepe yako kwa urejeshaji wa akaunti siku zijazo

source: Enclosure
sw: Imewekewa ulinzi kwa kufichwa

source: Enter email
sw: Ingiza barua pepe

source: Email address
sw: Barua pepe

source: exit
sw: Kutoka

source: Add Address
sw: Ongeza Address

source: Name
sw: Jina

source: Enter name
sw: Ingiza Jina

source: Success
sw: Imefanikiwa

source: No Data
sw: Hamna taarifa

source: Send Coins
sw: Tuma Shilingi

source: From
sw: Kutoka

source: To
sw: Kwenda

# searchaddress
source: Search or paste recipient address here
sw: Tafuta au nakili address ya mtumiwa apa

source: OR
sw: Au

# qrCode
source: Scan QR code
sw: Changanua msimbo wa qr

source: Enter Amount
sw: Ingiza Kiasi

source: Amount
sw: Kiasi

source: Estimated Fee
sw: Ada iliyokadiriwa

source: Total
sw: Jumla

source: Add
sw: Ongeza

source: Saved
sw: Imenifadhiwa

source: Add Address to notebook
sw: Ongeza address kwenye kitabu

source: New Request
sw: Ombi Jipya

# noPaired
source: No paired Device
sw: hakuna kifaa kilichooanishwa

source: Partnership Request
sw: Ombi la Ushirikiano

# enterDestination
source: Enter DEstination Address
sw: Ingiza address Lengwa

source: Accept Request
sw: Kubali Ombi

source: Reject Request
sw: Kataa Ombi

source: Paired Address
sw: Address zilizooanishwa

source: Connect
sw: Unganisha
